nrfconnect/sdk-nrf/applications/nrf5340_audio/src/bluetooth/le_audio_cis_gateway.c
	ret = channel_index_get(conn, &channel_index);
	if (ret) {
		LOG_ERR("Unknown connection, should not reach here");
		return;
	}

	ret = temp_cap_index_get(conn, &temp_cap_index);
	if (ret) {
		LOG_ERR("Could not get temporary CAP storage index");
		return;
	}

	/* At this point the location/channel index of the headset is always known */
	for (int i = 0; i < temp_cap[temp_cap_index].num_caps; i++) {
		memcpy(&headsets[channel_index].source_codec_cap[i],
		       &temp_cap[temp_cap_index].codec[i], sizeof(struct bt_codec));
	}

	LOG_DBG("Source discover complete");

	if (valid_codec_cap_check(headsets[channel_index].source_codec_cap,
				  temp_cap[temp_cap_index].num_caps)) {
		if (conn == headsets[AUDIO_CH_L].headset_conn) {
			bt_codec_allocation_set(&lc3_preset_source.codec,
						BT_AUDIO_LOCATION_FRONT_LEFT);
		} else if (conn == headsets[AUDIO_CH_R].headset_conn) {
			bt_codec_allocation_set(&lc3_preset_source.codec,
						BT_AUDIO_LOCATION_FRONT_RIGHT);
		} else {
			LOG_ERR("Unknown connection, cannot set allocation");
		}

		ret = bt_bap_stream_config(conn, &headsets[channel_index].source_stream,
					   headsets[channel_index].source_ep,
					   &lc3_preset_source.codec);
		if (ret) {
			LOG_WRN("Could not configure stream");
		}
	} else {
		LOG_WRN("No valid codec capability found for %s headset source",
			headsets[channel_index].ch_name);
	}

	/* Free up the slot in temp_cap */
	memset(temp_cap[temp_cap_index].codec, 0, sizeof(temp_cap[temp_cap_index].codec));
	temp_cap[temp_cap_index].conn = NULL;
	temp_cap[temp_cap_index].num_caps = 0;
}

static void disconnected_headset_cleanup(uint8_t chan_idx)
{
	headsets[chan_idx].headset_conn = NULL;
	k_work_cancel_delayable(&headsets[chan_idx].stream_start_sink_work);
	headsets[chan_idx].sink_ep = NULL;
	memset(headsets[chan_idx].sink_codec_cap, 0, sizeof(headsets[chan_idx].sink_codec_cap));
	k_work_cancel_delayable(&headsets[chan_idx].stream_start_source_work);
	headsets[chan_idx].source_ep = NULL;
	memset(headsets[chan_idx].source_codec_cap, 0, sizeof(headsets[chan_idx].source_codec_cap));

	headsets[chan_idx].num_eps = 0;
}

static int discover_sink(struct bt_conn *conn)
{
	int ret;
	static uint8_t discover_index;

	unicast_client_cbs.discover = discover_sink_cb;

	ret = bt_bap_unicast_client_discover(conn, BT_AUDIO_DIR_SINK);
	discover_index++;

	/* Avoid multiple discover procedure sharing the same params */
	if (discover_index >= CONFIG_BT_MAX_CONN) {
		discover_index = 0;
	}

	return ret;
}

static int discover_source(struct bt_conn *conn)
{
	int ret;
	static uint8_t discover_index;

	unicast_client_cbs.discover = discover_source_cb;

	ret = bt_bap_unicast_client_discover(conn, BT_AUDIO_DIR_SOURCE);
	discover_index++;

	/* Avoid multiple discover procedure sharing the same params */
	if (discover_index >= CONFIG_BT_MAX_CONN) {
		discover_index = 0;
	}

	return ret;
}

static int iso_stream_send(uint8_t const *const data, size_t size, struct le_audio_headset headset)
{
	int ret;
	struct net_buf *buf;

	/* net_buf_alloc allocates buffers for APP->NET transfer over HCI RPMsg,
	 * but when these buffers are released it is not guaranteed that the
	 * data has actually been sent. The data might be queued on the NET core,
	 * and this can cause delays in the audio.
	 * When stream_sent_cb() is called the data has been sent.
	 * Data will be discarded if allocation becomes too high, to avoid audio delays.
	 * If the NET and APP core operates in clock sync, discarding should not occur.
	 */
	if (atomic_get(&headset.iso_tx_pool_alloc) >= HCI_ISO_BUF_ALLOC_PER_CHAN) {
		if (!headset.hci_wrn_printed) {
			LOG_WRN("HCI ISO TX overrun on %s ch - Single print", headset.ch_name);
			headset.hci_wrn_printed = true;
		}

		return -ENOMEM;
	}

	headset.hci_wrn_printed = false;

	buf = net_buf_alloc(headset.iso_tx_pool, K_NO_WAIT);
	if (buf == NULL) {
		/* This should never occur because of the iso_tx_pool_alloc check above */
		LOG_WRN("Out of TX buffers");
		return -ENOMEM;
	}

	net_buf_reserve(buf, BT_ISO_CHAN_SEND_RESERVE);
	net_buf_add_mem(buf, data, size);

	atomic_inc(&headset.iso_tx_pool_alloc);

	ret = bt_bap_stream_send(&headset.sink_stream, buf,
				 get_and_incr_seq_num(&headset.sink_stream), BT_ISO_TIMESTAMP_NONE);
	if (ret < 0) {
		LOG_WRN("Failed to send audio data to %s: %d", headset.ch_name, ret);
		net_buf_unref(buf);
		atomic_dec(&headset.iso_tx_pool_alloc);
	}

	return 0;
}

static int initialize(le_audio_receive_cb recv_cb, le_audio_timestamp_cb timestmp_cb)
{
	int ret;
	static bool initialized;
	int headset_iterator = 0;
	int stream_iterator = 0;
	struct bt_bap_unicast_group_stream_pair_param pair_params[ARRAY_SIZE(headsets)];
	/* 2 streams (one sink and one source stream) for each headset */
	struct bt_bap_unicast_group_stream_param stream_params[(ARRAY_SIZE(headsets) * 2)];
	struct bt_bap_unicast_group_param param;

	if (initialized) {
		LOG_WRN("Already initialized");
		return -EALREADY;
	}

	if (recv_cb == NULL) {
		LOG_ERR("Receive callback is NULL");
		return -EINVAL;
	}

	if (timestmp_cb == NULL) {
		LOG_ERR("Timestamp callback is NULL");
		return -EINVAL;
	}

	receive_cb = recv_cb;
	timestamp_cb = timestmp_cb;

	LOG_DBG("Start workers");

	for (int i = 0; i < ARRAY_SIZE(headsets); i++) {
		headsets[i].sink_stream.ops = &stream_ops;
		headsets[i].source_stream.ops = &stream_ops;
		k_work_init_delayable(&headsets[i].stream_start_sink_work, work_stream_start);
		k_work_init_delayable(&headsets[i].stream_start_source_work, work_stream_start);
	}

	ret = bt_bap_unicast_client_register_cb(&unicast_client_cbs);
	if (ret != 0) {
		LOG_ERR("Failed to register client callbacks: %d", ret);
		return ret;
	}

	for (int i = 0; i < ARRAY_SIZE(headsets); i++) {
		headsets[i].iso_tx_pool = iso_tx_pools[i];
		switch (i) {
		case AUDIO_CH_L:
			headsets[i].ch_name = "LEFT";
			break;
		case AUDIO_CH_R:
			headsets[i].ch_name = "RIGHT";
			break;
		default:
			LOG_WRN("Trying to set name to undefined channel");
			headsets[i].ch_name = "UNDEFINED";
			break;
		}
	}

	for (int i = 0; i < ARRAY_SIZE(stream_params); i++) {
		/* Every other stream should be sink or source */
		if ((i % 2) == 0) {
			stream_params[i].qos = &lc3_preset_sink.qos;
			stream_params[i].stream = &headsets[headset_iterator].sink_stream;
		} else {
			stream_params[i].qos = &lc3_preset_source.qos;
			stream_params[i].stream = &headsets[headset_iterator].source_stream;
			headset_iterator++;
		}
	}

	for (int i = 0; i < ARRAY_SIZE(pair_params); i++) {
		pair_params[i].tx_param = &stream_params[stream_iterator];
		stream_iterator++;

		if (IS_ENABLED(CONFIG_BT_AUDIO_RX)) {
			pair_params[i].rx_param = &stream_params[stream_iterator];
		} else {
			pair_params[i].rx_param = NULL;
		}

		stream_iterator++;
	}

	param.params = pair_params;
	param.params_count = ARRAY_SIZE(pair_params);

