nrfconnect/sdk-nrf/applications/nrf5340_audio/src/bluetooth/le_audio_cis_gateway.c
	if (IS_ENABLED(CONFIG_BT_AUDIO_PACKING_INTERLEAVED)) {
		param.packing = BT_ISO_PACKING_INTERLEAVED;
	} else {
		param.packing = BT_ISO_PACKING_SEQUENTIAL;
	}

	ret = bt_bap_unicast_group_create(&param, &unicast_group);
	if (ret) {
		LOG_ERR("Failed to create unicast group: %d", ret);
		return ret;
	}

	initialized = true;

	return 0;
}

int le_audio_user_defined_button_press(enum le_audio_user_defined_action action)
{
	ARG_UNUSED(action);

	LOG_WRN("%s not supported", __func__);
	return -ENOTSUP;
}

int le_audio_config_get(uint32_t *bitrate, uint32_t *sampling_rate, uint32_t *pres_delay)
{
	ARG_UNUSED(bitrate);
	ARG_UNUSED(sampling_rate);
	ARG_UNUSED(pres_delay);

	LOG_WRN("%s not supported", __func__);
	return -ENOTSUP;
}

void le_audio_conn_set(struct bt_conn *conn)
{
	int ret;

	ret = discover_sink(conn);
	if (ret) {
		LOG_WRN("Failed to discover sink: %d", ret);
	}
}

void le_audio_conn_disconnected(struct bt_conn *conn)
{
	int ret;
	uint8_t channel_index;

	ret = channel_index_get(conn, &channel_index);
	if (ret) {
		LOG_WRN("Unknown connection disconnected");
	} else {
		disconnected_headset_cleanup(channel_index);
	}
}

int le_audio_ext_adv_set(struct bt_le_ext_adv *ext_adv)
{
	ARG_UNUSED(ext_adv);

	LOG_WRN("%s not supported", __func__);
	return -ENOTSUP;
}

void le_audio_adv_get(const struct bt_data **adv, size_t *adv_size, bool periodic)
{
	ARG_UNUSED(adv);
	ARG_UNUSED(adv_size);
	ARG_UNUSED(periodic);

	LOG_WRN("%s not supported", __func__);
}

int le_audio_pa_sync_set(struct bt_le_per_adv_sync *pa_sync, uint32_t broadcast_id)
{
	ARG_UNUSED(pa_sync);
	ARG_UNUSED(broadcast_id);

	LOG_WRN("%s not supported", __func__);
	return -ENOTSUP;
}

int le_audio_play(void)
{
	int ret_left = 0;
	int ret_right = 0;

	if (ep_state_check(headsets[AUDIO_CH_L].sink_stream.ep, BT_BAP_EP_STATE_QOS_CONFIGURED)) {
		ret_left = bt_bap_stream_enable(&headsets[AUDIO_CH_L].sink_stream,
						lc3_preset_sink.codec.meta,
						lc3_preset_sink.codec.meta_count);

		if (ret_left) {
			LOG_WRN("Failed to enable left stream: %d", ret_left);
		}
	}

	if (ep_state_check(headsets[AUDIO_CH_R].sink_stream.ep, BT_BAP_EP_STATE_QOS_CONFIGURED)) {
		ret_right = bt_bap_stream_enable(&headsets[AUDIO_CH_R].sink_stream,
						 lc3_preset_sink.codec.meta,
						 lc3_preset_sink.codec.meta_count);

		if (ret_right) {
			LOG_WRN("Failed to enable right stream: %d", ret_right);
		}
	}

	if (ret_left || ret_right) {
		return -EIO;
	}

	playing_state = true;

	return 0;
}

int le_audio_pause(void)
{
	int ret_left = 0;
	int ret_right = 0;

	le_audio_event_publish(LE_AUDIO_EVT_NOT_STREAMING, NULL);

	if (ep_state_check(headsets[AUDIO_CH_L].sink_stream.ep, BT_BAP_EP_STATE_STREAMING)) {
		ret_left = bt_bap_stream_disable(&headsets[AUDIO_CH_L].sink_stream);

		if (ret_left) {
			LOG_WRN("Failed to disable left stream: %d", ret_left);
		}
	}

	if (ep_state_check(headsets[AUDIO_CH_R].sink_stream.ep, BT_BAP_EP_STATE_STREAMING)) {
		ret_right = bt_bap_stream_disable(&headsets[AUDIO_CH_R].sink_stream);

		if (ret_right) {
			LOG_WRN("Failed to disable right stream: %d", ret_right);
		}
	}

	if (ret_left || ret_right) {
		return -EIO;
	}

	playing_state = false;

	return 0;
}

int le_audio_send(struct encoded_audio enc_audio)
{
	int ret;
	size_t data_size_pr_stream;
	struct bt_iso_tx_info tx_info = {0};

	if ((enc_audio.num_ch == 1) || (enc_audio.num_ch == ARRAY_SIZE(headsets))) {
		data_size_pr_stream = enc_audio.size / enc_audio.num_ch;
	} else {
		LOG_ERR("Num encoded channels must be 1 or equal to num headsets");
		return -EINVAL;
	}

	if (data_size_pr_stream != LE_AUDIO_SDU_SIZE_OCTETS(CONFIG_BT_AUDIO_BITRATE_UNICAST_SINK)) {
		LOG_ERR("The encoded data size does not match the SDU size");
		return -EINVAL;
	}

	if (ep_state_check(headsets[AUDIO_CH_L].sink_stream.ep, BT_BAP_EP_STATE_STREAMING)) {
		ret = bt_iso_chan_get_tx_sync(&headsets[AUDIO_CH_L].sink_stream.ep->iso->chan,
					      &tx_info);
	} else if (ep_state_check(headsets[AUDIO_CH_R].sink_stream.ep, BT_BAP_EP_STATE_STREAMING)) {
		ret = bt_iso_chan_get_tx_sync(&headsets[AUDIO_CH_R].sink_stream.ep->iso->chan,
					      &tx_info);
	} else {
		/* This can happen if a headset is reset and the state in
		 * streamctrl hasn't had time to update yet
		 */
		LOG_DBG("No headset in stream state");
		return -ECANCELED;
	}

	if (ret) {
		LOG_DBG("Error getting ISO TX anchor point: %d", ret);
	}

	if (tx_info.ts != 0 && !ret) {
		if (!IS_ENABLED(CONFIG_STREAM_BIDIRECTIONAL)) {
			timestamp_cb(tx_info.ts, true);
		}
	}

	if (ep_state_check(headsets[AUDIO_CH_L].sink_stream.ep, BT_BAP_EP_STATE_STREAMING)) {
		ret = iso_stream_send(enc_audio.data, data_size_pr_stream, headsets[AUDIO_CH_L]);
		if (ret) {
			LOG_DBG("Failed to send data to left channel");
		}
	}

	if (ep_state_check(headsets[AUDIO_CH_R].sink_stream.ep, BT_BAP_EP_STATE_STREAMING)) {
		if (enc_audio.num_ch == 1) {
			ret = iso_stream_send(enc_audio.data, data_size_pr_stream,
					      headsets[AUDIO_CH_R]);
		} else {
			ret = iso_stream_send(&enc_audio.data[data_size_pr_stream],
					      data_size_pr_stream, headsets[AUDIO_CH_R]);
		}
		if (ret) {
			LOG_DBG("Failed to send data to right channel");
		}
	}

	return 0;
}

int le_audio_enable(le_audio_receive_cb recv_cb, le_audio_timestamp_cb timestmp_cb)
{
	int ret;

	ret = initialize(recv_cb, timestmp_cb);
	if (ret) {
		return ret;
	}
	LOG_DBG("Initialized");

	return 0;
}

int le_audio_disable(void)
{
	return -ENOTSUP;
}
